//
//  MockPost.swift
//  Avtomobilka
//
//  Created by Steven Kirke on 06.08.2023.
//

import Foundation


let mockPosts: String = #"""
{
    "posts": [
        {
            "id": 563,
            "text": "Доброго всем дня. Так как лето потихоньку приближается, начал я исследовать просторы интернета по поводу двадцатых тапочек на лето. В приоритете у меня, скажу честно, родные 20ые suzuka, хотя понравилось ещё пару вариантов от ABT.\r\n\r\nИ вот какой вопрос. На просторах авито помимо продажи оригинальных комплектов сузуки, увидел я реплики.\r\n\r\nПонятно, что в большинстве случаев реплика — это фупозоркактакможноваще, но, во-первых, кризис в стране :-), а, во-вторых, посещают паранойные мысли типа «приеду я покупать типа оригинальные, а это будут неоригиналы» Поэтому вопрос к знатокам. Видел может кто-то вживую эти неоригиналы, как они? И как отличить оригиналы от неоригиналов?",
            "like_count": 7,
            "created_at": "2019-02-24 21:53:19",
            "comment_count": 3,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/563/b35648c11e2b74154d1d09c1a649b40f.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 546,
            "text": "Вот такую ситуацию обнаружил сегодня, помыв машину.\r\n\r\nВся грязь с пленки не отмывается обычной мойкой и остаётся на машине. В прошлый раз по совету ребят, которые клеили пленку покрыл машину воском, возможно, из-за водонерастворимого состава воска, грязь въелась в него и удалять надо каким-то жироудалителем (надо узнавать каким, чтобы с пленкой ничего не произошло).\r\n\r\nВторое мое предположение, почему так произошло заключается в анологии с краской. Насколько я знаю, матовая краска, если рассматривать ее под микроскопом очень шероховатая, за счёт чего отраженный свет теряется в этих самых шероховатостях и приобретается матовый эффект, поэтому матовая краска не является моющейся, а вот глянцевая имеет наоборот максимально ровную поверхность за счёт чего грязь с неё легко удалятся. Ладно, будем думать, читать, общаться с теми, кто клеил пленку. А Вы как думаете, что делать в данной ситуации?",
            "like_count": 6,
            "created_at": "2019-02-15 23:05:01",
            "comment_count": 3,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/546/12ddc1a35fce182a0c064faa4baacdd0.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 528,
            "text": "Прогуливаясь по Риге, увидел припаркованный тигуан с запотевшими поворотниками. Так что, это точно не проблема российской сборки)",
            "like_count": 8,
            "created_at": "2019-02-06 21:21:16",
            "comment_count": 1,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/528/10a7db341b16c4c57108525613c8dc9d.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 504,
            "text": "Достаточно спонтанно родилась идея — а почему бы не махнуть в Прибалтику на новеньком автомобиле. При том, что автомобильные путешествия мне очень нравятся, особенно после прошлого года, когда я доехал до Барселоны на Ранглере 1987 года выпуска. Ну, раз решили, то быстренько пакуем чемоданы и выезжаем. Разумеется, предвидя, что таких умненьких, кто захочет перед Новым годом выехать в ближнее зарубежье на авто будет не мало, было принято решение выезжать 29 декабря вечером (по факту выехали в 22.00), а это последний рабочий день, чтобы к утру оказаться на Белорусско Литовской границе. Сразу скажу, что 29 числа у меня был полноценный рабочий день, к тому же, я скорее жаворонок и часам к 4 ночи (а это лишь половина пути) я сильно пожалел о ночном перегоне. Меня не спасал ни кофе, ни зарядка на свежем воздухе, ни снег растертый об лицо, поэтому, если запланировали дальний перегон, то обязательно учитывайте свои биоритмы. При выезде из Москвы навигатор предложил два пути, первый по Минскому шоссе, до, (как ни странно:-)) Минска, а затем уход на север к Вильнюсу, второй по Новой Риге, через Ржев. Первым путём я ездил в прошлом году, поэтому решил попробовать второй, тем более по времени навигатор писал, что разницы нет. Конечно, ехать по Новой Риге одно удовольствие, ни одного светофора, много полос, почти все участки освещены. Одна проблема — Новая Рига быстро заканчивается и вы утыкаетесь в двухполосную дорогу, которая при наличии большого количества фур может превратиться в пытку. (Могу ошибаться, но по моим воспоминаниям, дорога на Минск практически на всём пути была четырехполосная, что делает ее на порядок комфортней и более рекомендуемой для поездок). Хотя, отмечу, что ночью машин практически не было, а те редковстречающиеся я без проблем обгонял. Второй проблемой будет то, что если Вы, как и я, заправляетесь 98-100 бензином, то найти его на трассе практически невозможно. Я залил полный бак на выезде из Москвы и его хватило до границы с Беларусью. Средний расход за время поездки где-то 8,5-9 литров.\r\nДоехав до Великих Лук, навигатор предложил мне уйти чуть ниже в сторону Невеля и въехать в Литву через Шумск. И это была самая лучшая идея. На границу я подъехал в районе 7 часов утра с заранее купленной дома гринкартой, передо мной было 6-7 машин, причём двигалась очередь достаточно бодро (вспомнив, как поляки час обыскивали машину стоящую передо мной и спокойно выдохнув) и уже в 7.30 преодолев границу, я заехал на территорию Литвы.\r\nКстати, все предыдущие поездки я использовал обычные российские права (розовые такие), потому что на них вся информация продублирована на английском, но тут мне несколько знакомых сказали, что у них были проблемы в Европе с такими правами при встрече с полицейскими. Поэтому перед поездкой я решил получить права международные, и это тот ещё квест, скажу я вам) заявление сейчас подаётся через госуслуги, что в общем то удобно, плюс скидка при оплате пошлины онлайн составляет 30%. Но было и несколько проблем. Во-первых, на все Подмосковье всего несколько отделений ГИБДД, которые выдают эти права. Рядом с моим Жуковским таких отделений два, это Балашиха и Подольск. Не ближний свет, конечно. Ну ладно, вторая проблема оказалась в том, что мест свободных под запись в Балашихе, которая поближе до Нового Года нет совсем (записывался я в районе 17 декабря), а в Подольске осталась буквально одна дата на утро 28 декабря.\r\n\r\n\r\n\r\nМеждународное водительское удостоверение\r\nДля получения прав необходимо взять с собой фотографию 3,5 на 4,5, которую в них вклеют, хотя в Подольском отделении есть комната, где за деньги вас сфотографируют. Да, самый забавный момент. По приезду в отделение я увидел одно окно, в которое принимаются документы в порядке живой очереди, причём туда стоят, те кто не записывался на портале, а для тех кто записывался висит табличка, которая гласит, что они могут подходить к окошку вне очереди, что, разумеется, вызывает пригорание одного места у первых.\r\nФоток по первой части, практически нет, ибо была ночь, да и ничего красивого я не увидел по пути, только лес и дорога.\r\nНу, а о самом путешествии по территории Прибалтики напишу в следующей части. Рад любым вопросам. Кстати, как Вы относитесь к автопутешествиям? Или проще долететь и взять машину в аренду? Пишите в комментариях)",
            "like_count": 12,
            "created_at": "2019-01-28 00:08:24",
            "comment_count": 2,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/504/dac56453c0300578d08bbda42d55fdb5.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 466,
            "text": "Господа, кажется, что скоро подсветка панорамной крыши заработает)\r\n\r\n«Росстандарт сообщил о проведении отзыва кроссоверов марки Volkswagen, реализованных в России с 2017 года по 2018 год\r\nРечь идет об автомобилях, в комплектации которых есть панорамный люк. Всего на сервис придется заехать 4 320 владельцам таких «Тигуанов». Проблема, как следует из сообщения Росстандарта, выявлена в блоке подсветки данного элемента.\r\n\r\nПричиной отзыва транспортных средств Volkswagen Tiguan с эстетической подсветкой панорамного подъёмно-сдвижного стеклянного люка является проникновение влаги в светодиодный модуль подсветки. В результате этого может возникнуть короткое замыкание с последующим тепловыделением\r\nРосстандарт\r\nОтмечается, что на таких автомобилях будет установлено два кабель-адаптера (один со стороны водителя и один со стороны переднего пассажира) со встроенным предохранителем между областью подачи питания и светодиодным модулем эстетической подсветки панорамного подъёмно-сдвижного стеклянного люка.\r\nВсе работы будут осуществляться бесплатно для владельцев» (взято с automail.ru)",
            "like_count": 12,
            "created_at": "2019-01-22 00:10:50",
            "comment_count": 2,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/466/52e6d290dfafc88c00cc70d49cdede9c.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 431,
            "text": "Спустя неделю после оклейки пленкой помыл авто, да ещё и солнце выглянуло. Поэтому быстренько взял фотик и сделал пару фотографий. Так как я профессиональный фотограф, то сразу же завалил горизонты, фотографировал с солнцем в кадре, столбами и прочими непотребствами.",
            "like_count": 15,
            "created_at": "2019-01-15 11:35:06",
            "comment_count": 1,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/431/f7c3ab7a22083039fae8668413e88c60.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 397,
            "text": "Хочу задать вопрос владельцам тигуанов. Так получилось, что в машине стоимостью 2,5 млн накладки на передние пороги установлены (и даже подсвечиваются),\r\n\r\nПолазив по Алиэкспрессу я обнаружил накладки только на металлическую часть порога,\r\n\r\nКлеится она, судя по картинке, на металл который на самом краю\r\n\r\nа на пластиковую не увидел. Хотел узнать — кто-то решал данную проблему, может я просто искал плохо?",
            "like_count": 7,
            "created_at": "2019-01-08 12:04:27",
            "comment_count": 1,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/397/4e27951e4fb78df47f8b09039768bd47.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 381,
            "text": "Сегодня, наконец-то, забрал машину с пленки. Клеили ее долгих (для меня) четыре дня. В итоге машинка покрыта прозрачной матовой виниловой пленкой hexis. Конечно, виниловая пленка не обладает такими защитными свойствами, как полиуретан, но от легкого пескоструя при езде по городу защитит спокойно, плюс, мне хотелось добиться некоторой индивидуальности.\r\n\r\nУдобный способ греть воду для чая\r\nВ процессе работы ребята столкнулись с парой проблем. Не получилось красиво оклеить чёрные декоративные элементы у переднего бампера, но пообщавшись с несколькими драйвовчанами, кто клеил пленку себе, я выяснил, что у всех не получилось их заклеить, но эти элементы можно приобрести отдельно в случае повреждений, так что я не сильно расстроился. Кроме этого, не получилось снять рейлинги, чтобы завести пленку на крыше под них, поэтому клеили просто заподлицо к ним.\r\n\r\nВ процессе решили, что надо сделать антихром для нижних молдингов, чтобы по 10 раз их не снимать/устанавливать. Так как в планах у меня это все равно было, то сопротивляться я не стал.\r\nПри покупке у тигуана была заводская тонировка, но, на мой взгляд, она относительно прозрачная, поэтому дополнительно закатали Люмаром 15%. Передние стекла буду делать после Нового Года, потому что запланирована поездка в Европу на машине на праздники.\r\n\r\nТакже, в чёрную пленку заклеили кусочек спойлера, чтобы был такой суперпупер спорт стиль, ну и шильдики Tiguan и 4motion возвращать после всех работ не стали. В целом, вид изменился в лучшую сторону, на мой взгляд, плюс стал более индивидуальным.\r\n\r\nПостараюсь ещё дополнительно сделать фотографии получше, чтобы показать изменения во внешнем виде, пока просто на телефон на фоне гаражей. В планах теперь сделать антихром молднигов вокруг стёкол и забронировать фары. Пока все) Что скажете про вид? Что ещё можно сделать с внешностью? Пишите в комментарии.",
            "like_count": 15,
            "created_at": "2018-12-31 12:35:44",
            "comment_count": 1,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/381/7852abf28f22df517d7482c60b9cbc07.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 317,
            "text": "Фух, что-то никак не мог добраться до бортовика. Под конец года, конечно, работы много и с долгами в Новый год не хочется. У Вас, кстати, нет запар перед Новым Годом? Подарки всем купи, дела все сделай. При этом повсюду очень много людей, которые хотят всего того же самого.\r\nСегодня, спустя две с небольшим недели я поставил машину на учёт. Сначала, когда забрал ее из салона, я как-то не торопился, думал покататься пару дней и поехать ставить на учёт, но, видимо, перед Новым Годом народу много не только в магазинах, но и в ГИБДД, потому что сайт госуслуг любезно предложил мне дату через девять дней от даты подачи заявления. Ну, куда деваться, решил, раз прилетаю на штраф, то необходимо оставшееся до регистрации время окупать отсутствие номеров, благо, камер в округе много…)\r\nВсе-таки, как бы мы не любили хаять наше дорогое правительство и государственные структуры, а с появлением возможности подавать документы и вставать в очередь электронно процесс стал значительно приятней, потому весь процесс регистрации с площадкой и всеми документами занял порядка 30 минут (особенно позабавил инспектор выполнявший финальные действия, потому что он гораздо сильнее был увлечён трансляцией матча Арсенал — Тотенхэм, чем приемом документов (Кто победил, кстати?)",
            "like_count": 6,
            "created_at": "2018-12-29 15:36:49",
            "comment_count": 1,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/317/29172dc67491a591f9f04d88d76d684b.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        },
        {
            "id": 253,
            "text": "Вообще сегодня я планировал поставить машину на оклейку прозрачной матовой пленкой, кстати, как думаете в мате будет смотреться круче или хуже? Мне кажется, что интересней, потому что матовая плёнка сделает все грани кузова, а их много, более выразительными. Но, пленка ещё не приехала в сервис, поэтому процедура переносится на следующую неделю.\r\n\r\nПравда, у меня тут возник следующий вопрос. Кто каким бензином заправляется и что посоветует? Дело в том, что на лючке написано заправлять 98, а у меня в округе ни на одной заправке его нет. Точнее есть 100 на BP, но про неё вечно какие-то не очень хорошие отзывы слышу. Поэтому пока залил 95. Но и тут возникает вопрос — что лучше? 95 простой или 95 экто/g drive/ultimate? На прошлой машине (opel astra j GTC) заправлялся 95 экто и к 36 тысячам пробега прилетел на капиталку двигателя. Благо машина была на гарантии и все починили, но ОД уверял меня, что это из-за плохого бензина и рекомендовал заправляться обычным 95, потому что в нем нет никаких присадок. ОД ВАГа сказал наоборот, заправляйте 95 с присадками. Поэтому хочу услышать Ваше мнение — чем заправляетесь?",
            "like_count": 6,
            "created_at": "2018-12-27 20:56:28",
            "comment_count": 2,
            "img": "http://am111.05.testing.place/uploads/user/37/auto/49/post/253/51e3d7aaa76d3968cc4904bcb20e3172.jpg",
            "author": {
                "id": 37,
                "username": "lexer7",
                "avatar": {
                    "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
                    "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
                },
                "auto_count": 1,
                "main_auto_name": "Volkswagen Tiguan"
            }
        }
    ],
    "user": {
        "id": 37,
        "username": "lexer7",
        "avatar": {
            "path": "uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg",
            "url": "http://am111.05.testing.place/uploads/user/37/avatars/hkVsjX1d8CUWIfNRLk4Bo29NBMFsAio1sQiKSV5o.jpg"
        },
        "auto_count": 1,
        "main_auto_name": "Volkswagen Tiguan"
    }
}
"""#
